COLLEGE_CATEGORY = (
    ('hum', '인문대학'),
    ('soc', '사회과학대학'),
    ('nat', '자연과학대학'),
    ('nur', '간호대학'),
    ('mba', '경영대학'),
    ('eng', '공과대학'),
    ('agr', '농업생명과학대학'),
    ('art', '미술대학'),
    ('law', '법과대학'),
    ('edu', '사범대학'),
    ('che', '생활과학대학'),
    ('vet', '수의과대학'),
    ('pha', '약학대학'),
    ('mus', '음악대학'),
    ('med', '의과대학'),
    ('cls', '자유전공학부'),
    ('uni', '연합전공'),
    ('cor', '연계전공'),
)
DEPARTMENT_DICT = {
    'hum': (
        ('aa', '국어국문학과'),
        ('bb', '중어중문학과'),
        ('cc', '영어영문학과'),
        ('dd', '독어독문학과'),
        ('ee', '노어노문학과'),
        ('ff', '서어서문학과'),
        ('gg', '아시아언어문명학부'),
        ('hh', '불어불문학과'),
        ('ii', '언어학과'),
        ('jj', '국사학과'),
        ('kk', '동양사학과'),
        ('ll', '서양사학과'),
        ('mm', '철학과'),
        ('nn', '종교학과'),
        ('oo', '미학과'),
        ('pp', '고고미술사학과')
    ),
    'soc': (
        ('qq', '정치외교학부'),
        ('rr', '경제학부'),
        ('ss', '사회학과'),
        ('tt', '인류학과'),
        ('uu', '심리학과'),
        ('vv', '지리학과'),
        ('ww', '사회복지학과'),
        ('xx', '언론정보학과')
    ),
    'nat': (
        ('yy', '수리과학부'),
        ('zz', '통계학과'),
        ('ab', '물리천문학부'),
        ('ac', '화학부'),
        ('ad', '생명과학부'),
        ('ae', '지구환경과학부')
    ),
    'nur': (
        ('af', '간호학과'),
    ),
    'mba': (
        ('ag', '경영학과'),
    ),
    'eng': (
        ('ah', '건설환경공학부'),
        ('ai', '기계항공공학부'),
        ('aj', '재료공학부'),
        ('ak', '전기정보공학부'),
        ('al', '컴퓨터공학부'),
        ('am', '산업공학과'),
        ('an', '화학생물공학부'),
        ('ao', '건축학과'),
        ('ap', '건축공학과'),
        ('aq', '조선해양공학과'),
        ('ar', '에너지자원공학과'),
        ('as', '원자력공학과')
    ),
    'agr': (
        ('at', '식물생산과학부'),
        ('au', '산림과학부'),
        ('av', '응용생물화학부'),
        ('aw', '식품동물생명공학부'),
        ('ax', '바비오시스템소재학부'),
        ('ay', '조경지역시스템공학부'),
        ('az', '농경제사회학부')
    ),
    'art': (
        ('bc', '동양화과'),
        ('bd', '서양화과'),
        ('be', '조소과'),
        ('bf', '공예과'),
        ('bg', '디자인과')
    ),
    'law': (
        ('lw', '법학부'),
    ),
    'edu': (
        ('11', '교육학과'),
        ('22', '국어교육과'),
        ('33', '영어교육과'),
        ('44', '불어교육과'),
        ('55', '독어교육과'),
        ('66', '사회교육과'),
        ('77', '역사교육과'),
        ('88', '지리교육과'),
        ('99', '윤리교육과'),
        ('00', '수학교육과'),
        ('1a', '물리교육과'),
        ('1b', '화학교육과'),
        ('1c', '생물교육과'),
        ('1d', '지구과학교육과'),
        ('1e', '체육교육과')
    ),
    'che': (
        ('1f', '소비자아동학부'),
        ('1g', '식품영양학과'),
        ('1h', '의류학과')
    ),
    'vet': (
        ('1i', '수의예과'),
        ('1j', '수의학과')
    ),
    'pha': (
        ('1k', '약학과'),
        ('1l', '제약학과')
    ),
    'mus': (
        ('1m', '성악과'),
        ('1n', '작곡과(이론)'),
        ('1o', '작곡과(작곡)'),
        ('1p', '기악과'),
        ('1q', '국악과')
    ),
    'med': (
        ('1r', '의예과'),
        ('1s', '의학과')
    ),
    'cls': (
        ('1t', '자유전공학부'),
    ),
    'uni': (
        ('2a', '계산과학'),
        ('2b', '글로벌환경경영학'),
        ('2c', '기술경영'),
        ('2d', '영상매체예술'),
        ('2e', '정보문화학'),
        ('2f', '벤처경영학'),
        ('2g', '동아시아비교인문학')
    ),
    'cor': (
        ('3a', '중국학'),
        ('3b', '미국학'),
        ('3c', '러시아학'),
        ('3d', '라틴아메리카학'),
        ('3e', '유럽지역학'),
        ('3f', '뇌마음행동'),
        ('3g', '금융경제'),
        ('3h', '금융수학'),
        ('3i', '과학기술학'),
        ('3j', '공학바이오'),
        ('3k', '통합창의디자인'),
        ('3l', '고전문헌학'),
        ('3m', '인문데이터과학'),
        ('3n', '정치경제철학')
    )
}

DEPARTMENT_CATEGORY = tuple([element for tupl in list(DEPARTMENT_DICT.values()) for element in tupl])

STUDENT_CATEGORY = (
    ('u', '학부'),
    ('g', '대학원'),
    ('i', '교환학생'),
)
SEMESTER_CATEGORY = (
    (1, '1학기'),
    (2, '2학기')
)
